mock-example/src/test/resources/xml/BBMO/SrvSendNaturalPersonApplicationStateChangeMessageRq/rq1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>SrvSendNaturalPersonApplicationProcessStageResult</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:SrvSendNaturalPersonApplicationStateChangeMessageRq xmlns:tns="http://sbrf.ru/prpc/bbmo/10">
         <tns:NaturalPersonApplicationState>
            <tns:ApplicationId>1234567890</tns:ApplicationId>
            <tns:ApplicationStatus>1</tns:ApplicationStatus>
            <!--optional--><tns:Comment>string</tns:Comment>
         </tns:NaturalPersonApplicationState>
         <!--optional--><tns:PackageId>string</tns:PackageId>
         <!--optional--><tns:TB>str</tns:TB>
      </tns:SrvSendNaturalPersonApplicationStateChangeMessageRq>
   </soap:Body>
</soap:Envelope>
